Tekla.Structures.Model.BoltGroup.ErrorStatus
Define possible statuses for geometry creation/modification commands.

Tekla.Structures.Model.BoltGroup.ErrorStatus.CommonSettingFromDiffPropertiesException
Exception thrown when the common setting cannot be computed from the individual settings.

Tekla.Structures.Model.BoltGroup.ErrorStatus.SlottedHoleOffsetsTooBigException
Exception thrown when the slotted hole offsets move hole too far from bolt origin.